{
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-POSITION",
    "2": "I-POSITION",
    "3": "B-REFERENCE",
    "4": "I-REFERENCE",
    "5": "B-ISSUING_AGENCY",
    "6": "I-ISSUING_AGENCY",
    "7": "B-DATE",
    "8": "I-DATE",
    "9": "B-DOC_TYPE",
    "10": "I-DOC_TYPE",
    "11": "B-SIGNER",
    "12": "I-SIGNER",
    "13": "B-RECIPIENT",
    "14": "I-RECIPIENT",
    "15": "B-DOC_NUMBER",
    "16": "I-DOC_NUMBER",
    "17": "B-SUMMARY",
    "18": "I-SUMMARY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DATE": 7,
    "B-DOC_NUMBER": 15,
    "B-DOC_TYPE": 9,
    "B-ISSUING_AGENCY": 5,
    "B-POSITION": 1,
    "B-RECIPIENT": 13,
    "B-REFERENCE": 3,
    "B-SIGNER": 11,
    "B-SUMMARY": 17,
    "I-DATE": 8,
    "I-DOC_NUMBER": 16,
    "I-DOC_TYPE": 10,
    "I-ISSUING_AGENCY": 6,
    "I-POSITION": 2,
    "I-RECIPIENT": 14,
    "I-REFERENCE": 4,
    "I-SIGNER": 12,
    "I-SUMMARY": 18,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
